{
  "feats": [
    {
      "name": "Alert",
      "category": "General",
      "prerequisite": "None",
      "repeatable": false,
      "benefits": [
        "+5 bonus to initiative",
        "You can't be surprised while you are conscious",
        "Other creatures don't gain advantage on attack rolls against you as a result of being hidden from you"
      ],
      "description": "Always on the lookout for danger, you gain the following benefits.",
      "grants_bonus": {
        "initiative": 5
      }
    },
    {
      "name": "Actor",
      "category": "General",
      "prerequisite": "None",
      "repeatable": false,
      "benefits": [
        "Increase your Charisma score by 1, to a maximum of 20",
        "You have advantage on Deception and Performance checks when trying to pass yourself off as a different person",
        "You can mimic the speech of another person or the sounds made by other creatures"
      ],
      "description": "Skilled at mimicry and dramatics, you gain the following benefits.",
      "ability_increases": {
        "ability": "Charisma",
        "amount": 1
      }
    },
    {
      "name": "Athlete",
      "category": "General",
      "prerequisite": "None",
      "repeatable": false,
      "benefits": [
        "Increase your Strength or Dexterity score by 1, to a maximum of 20",
        "When you are prone, standing up uses only 5 feet of your movement",
        "Climbing doesn't cost you extra movement",
        "You can make a running long jump or a running high jump after moving only 5 feet on foot"
      ],
      "description": "You have undergone extensive physical training to gain the following benefits.",
      "ability_increases": {
        "choices": ["Strength", "Dexterity"],
        "amount": 1
      }
    },
    {
      "name": "Charger",
      "category": "General",
      "prerequisite": "None",
      "repeatable": false,
      "benefits": [
        "When you use your action to Dash, you can use a bonus action to make one melee weapon attack or to shove a creature",
        "If you move at least 10 feet in a straight line immediately before taking this bonus action, you either gain a +5 bonus to the attack's damage roll or push the target up to 10 feet away from you"
      ],
      "description": "When you use your action to Dash, you can use a bonus action to make one melee attack or shove."
    },
    {
      "name": "Crossbow Expert",
      "category": "General",
      "prerequisite": "None",
      "repeatable": false,
      "benefits": [
        "You ignore the loading property of crossbows with which you are proficient",
        "Being within 5 feet of a hostile creature doesn't impose disadvantage on your ranged attack rolls",
        "When you use the Attack action and attack with a one-handed weapon, you can use a bonus action to attack with a loaded hand crossbow you are holding"
      ],
      "description": "Thanks to extensive practice with the crossbow, you gain the following benefits."
    },
    {
      "name": "Defensive Duelist",
      "category": "General",
      "prerequisite": "Dexterity 13 or higher",
      "repeatable": false,
      "benefits": [
        "When you are wielding a finesse weapon and another creature hits you with a melee attack, you can use your reaction to add your proficiency bonus to your AC for that attack, potentially causing the attack to miss you"
      ],
      "description": "When you are wielding a finesse weapon with which you are proficient and another creature hits you with a melee attack, you can use your reaction to add your proficiency bonus to your AC for that attack."
    },
    {
      "name": "Dual Wielder",
      "category": "General",
      "prerequisite": "None",
      "repeatable": false,
      "benefits": [
        "+1 bonus to AC while you are wielding a separate melee weapon in each hand",
        "You can use two-weapon fighting even when the one-handed melee weapons you are wielding aren't light",
        "You can draw or stow two one-handed weapons when you would normally be able to draw or stow only one"
      ],
      "description": "You master fighting with two weapons, gaining the following benefits.",
      "grants_bonus": {
        "ac_conditional": 1,
        "condition": "dual_wielding_melee"
      }
    },
    {
      "name": "Durable",
      "category": "General",
      "prerequisite": "None",
      "repeatable": false,
      "benefits": [
        "Increase your Constitution score by 1, to a maximum of 20",
        "When you roll Hit Dice to regain hit points, the minimum number of hit points you regain from the roll equals twice your Constitution modifier (minimum of 2)"
      ],
      "description": "Hardy and resilient, you gain the following benefits.",
      "ability_increases": {
        "ability": "Constitution",
        "amount": 1
      }
    },
    {
      "name": "Elemental Adept",
      "category": "General",
      "prerequisite": "The ability to cast at least one spell",
      "repeatable": true,
      "benefits": [
        "When you gain this feat, choose one of the following damage types: acid, cold, fire, lightning, or thunder",
        "Spells you cast ignore resistance to damage of the chosen type",
        "When you roll damage for a spell you cast that deals damage of that type, you can treat any 1 on a damage die as a 2"
      ],
      "description": "When you gain this feat, choose one of the following damage types: acid, cold, fire, lightning, or thunder. Spells you cast ignore resistance to damage of the chosen type.",
      "note": "You can select this feat multiple times, choosing a different damage type each time."
    },
    {
      "name": "Fey Touched",
      "category": "General",
      "prerequisite": "None",
      "repeatable": false,
      "benefits": [
        "Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20",
        "You learn the Misty Step spell and one 1st-level spell of your choice from the divination or enchantment school",
        "You can cast each of these spells without expending a spell slot once per long rest",
        "You can also cast these spells using spell slots you have of the appropriate level"
      ],
      "description": "Your exposure to the Feywild's magic has changed you, granting you the following benefits.",
      "ability_increases": {
        "choices": ["Intelligence", "Wisdom", "Charisma"],
        "amount": 1
      },
      "grants_spells": ["Misty Step", "One 1st-level divination or enchantment spell"]
    },
    {
      "name": "Grappler",
      "category": "General",
      "prerequisite": "Strength 13 or higher",
      "repeatable": false,
      "benefits": [
        "You have advantage on attack rolls against a creature you are grappling",
        "You can use your action to try to pin a creature grappled by you. If you succeed, you and the creature are both restrained until the grapple ends"
      ],
      "description": "You've developed the skills necessary to hold your own in close-quarters grappling."
    },
    {
      "name": "Great Weapon Master",
      "category": "General",
      "prerequisite": "None",
      "repeatable": false,
      "benefits": [
        "On your turn, when you score a critical hit with a melee weapon or reduce a creature to 0 hit points with one, you can make one melee weapon attack as a bonus action",
        "Before you make a melee attack with a heavy weapon that you are proficient with, you can choose to take a -5 penalty to the attack roll. If the attack hits, you add +10 to the attack's damage"
      ],
      "description": "You've learned to put the weight of a weapon to your advantage, letting its momentum empower your strikes."
    },
    {
      "name": "Healer",
      "category": "General",
      "prerequisite": "None",
      "repeatable": false,
      "benefits": [
        "When you use a healer's kit to stabilize a dying creature, that creature also regains 1 hit point",
        "As an action, you can spend one use of a healer's kit to tend to a creature and restore 1d6 + 4 hit points to it, plus additional hit points equal to the creature's maximum number of Hit Dice",
        "The creature can't regain hit points from this feat again until it finishes a short or long rest"
      ],
      "description": "You are an able physician, allowing you to mend wounds quickly and get your allies back in the fight."
    },
    {
      "name": "Heavy Armor Master",
      "category": "General",
      "prerequisite": "Proficiency with heavy armor",
      "repeatable": false,
      "benefits": [
        "Increase your Strength score by 1, to a maximum of 20",
        "While you are wearing heavy armor, bludgeoning, piercing, and slashing damage that you take from nonmagical weapons is reduced by 3"
      ],
      "description": "You can use your armor to deflect strikes that would kill others.",
      "ability_increases": {
        "ability": "Strength",
        "amount": 1
      }
    },
    {
      "name": "Inspiring Leader",
      "category": "General",
      "prerequisite": "Charisma 13 or higher",
      "repeatable": false,
      "benefits": [
        "You can spend 10 minutes inspiring your companions, shoring up their resolve to fight",
        "Choose up to six friendly creatures (which can include yourself) within 30 feet who can see or hear you and understand you",
        "Each creature gains temporary hit points equal to your level + your Charisma modifier",
        "A creature can't gain temporary hit points from this feat again until it has finished a short or long rest"
      ],
      "description": "You can spend 10 minutes inspiring your companions, giving them temporary hit points.",
      "features": [
        {
          "name": "Inspiring Speech",
          "description": "Spend 10 minutes inspiring up to 6 friendly creatures within 30 feet. Each gains temporary hit points equal to your level + your Charisma modifier.",
          "max_uses": "1",
          "rest_type": "Short Rest",
          "uses_formula": "1",
          "effect_formula": "level"
        }
      ]
    },
    {
      "name": "Keen Mind",
      "category": "General",
      "prerequisite": "None",
      "repeatable": false,
      "benefits": [
        "Increase your Intelligence score by 1, to a maximum of 20",
        "You always know which way is north",
        "You always know the number of hours left before the next sunrise or sunset",
        "You can accurately recall anything you have seen or heard within the past month"
      ],
      "description": "You have a mind that can track time, direction, and detail with uncanny precision.",
      "ability_increases": {
        "ability": "Intelligence",
        "amount": 1
      }
    },
    {
      "name": "Lucky",
      "category": "General",
      "prerequisite": "None",
      "repeatable": false,
      "benefits": [
        "You have 3 luck points",
        "Whenever you make an attack roll, ability check, or saving throw, you can spend one luck point to roll an additional d20",
        "You can choose to spend one of your luck points after you roll the die, but before the outcome is determined",
        "You choose which of the d20s is used for the attack roll, ability check, or saving throw",
        "You regain your expended luck points when you finish a long rest"
      ],
      "description": "You have inexplicable luck that seems to kick in at just the right moment.",
      "features": [
        {
          "name": "Luck Point",
          "description": "Spend a luck point to roll an additional d20 for an attack roll, ability check, or saving throw. You choose which d20 to use.",
          "max_uses": "3",
          "rest_type": "Long Rest",
          "uses_formula": "3",
          "effect_formula": "1d20"
        }
      ],
      "note": "You have 3 luck points. Regain all spent luck points on a long rest."
    },
    {
      "name": "Mage Slayer",
      "category": "General",
      "prerequisite": "None",
      "repeatable": false,
      "benefits": [
        "When a creature within 5 feet of you casts a spell, you can use your reaction to make a melee weapon attack against that creature",
        "When you damage a creature that is concentrating on a spell, that creature has disadvantage on the saving throw it makes to maintain its concentration",
        "You have advantage on saving throws against spells cast by creatures within 5 feet of you"
      ],
      "description": "You have practiced techniques in melee combat against spellcasters."
    },
    {
      "name": "Magic Initiate",
      "category": "General",
      "prerequisite": "None",
      "repeatable": true,
      "benefits": [
        "Choose a class: bard, cleric, druid, sorcerer, warlock, or wizard",
        "You learn two cantrips of your choice from that class's spell list",
        "You learn one 1st-level spell of your choice from that class's spell list",
        "You can cast this spell once per long rest without expending a spell slot",
        "You can also cast this spell using spell slots you have of the appropriate level"
      ],
      "description": "Choose a class. You learn two cantrips and one 1st-level spell from that class's spell list.",
      "grants_spells": ["Two cantrips", "One 1st-level spell"],
      "note": "You can select this feat multiple times, choosing a different class each time."
    },
    {
      "name": "Martial Adept",
      "category": "General",
      "prerequisite": "None",
      "repeatable": false,
      "benefits": [
        "You learn two maneuvers of your choice from among those available to the Battle Master archetype",
        "If a maneuver requires a saving throw, your maneuver save DC equals 8 + your proficiency bonus + your Strength or Dexterity modifier",
        "You gain one superiority die (d6), which is used to fuel your maneuvers",
        "This die is added to any superiority dice you have from another source",
        "You regain your expended superiority die when you finish a short or long rest"
      ],
      "description": "You have martial training that allows you to perform special combat maneuvers.",
      "features": [
        {
          "name": "Superiority Die",
          "description": "Use a superiority die (d6) to fuel a Battle Master maneuver. Maneuver save DC = 8 + proficiency + STR/DEX modifier.",
          "max_uses": "1",
          "rest_type": "Short Rest",
          "uses_formula": "1",
          "effect_formula": "1d6"
        }
      ]
    },
    {
      "name": "Medium Armor Master",
      "category": "General",
      "prerequisite": "Proficiency with medium armor",
      "repeatable": false,
      "benefits": [
        "Wearing medium armor doesn't impose disadvantage on your Dexterity (Stealth) checks",
        "When you wear medium armor, you can add 3, rather than 2, to your AC if you have a Dexterity of 16 or higher"
      ],
      "description": "You have practiced moving in medium armor to gain the following benefits."
    },
    {
      "name": "Mobile",
      "category": "General",
      "prerequisite": "None",
      "repeatable": false,
      "benefits": [
        "Your speed increases by 10 feet",
        "When you use the Dash action, difficult terrain doesn't cost you extra movement on that turn",
        "When you make a melee attack against a creature, you don't provoke opportunity attacks from that creature for the rest of the turn, whether you hit or not"
      ],
      "description": "You are exceptionally speedy and agile."
    },
    {
      "name": "Observant",
      "category": "General",
      "prerequisite": "None",
      "repeatable": false,
      "benefits": [
        "Increase your Intelligence or Wisdom score by 1, to a maximum of 20",
        "If you can see a creature's mouth while it is speaking a language you understand, you can interpret what it's saying by reading its lips",
        "You have a +5 bonus to your passive Perception and passive Investigation scores"
      ],
      "description": "Quick to notice details of your environment, you gain the following benefits.",
      "ability_increases": {
        "choices": ["Intelligence", "Wisdom"],
        "amount": 1
      },
      "grants_bonus": {
        "passive_perception": 5,
        "passive_investigation": 5
      }
    },
    {
      "name": "Polearm Master",
      "category": "General",
      "prerequisite": "None",
      "repeatable": false,
      "benefits": [
        "When you take the Attack action and attack with only a glaive, halberd, quarterstaff, or spear, you can use a bonus action to make a melee attack with the opposite end of the weapon",
        "This attack uses the same ability modifier as the primary attack and deals 1d4 bludgeoning damage",
        "While you are wielding a glaive, halberd, pike, quarterstaff, or spear, other creatures provoke an opportunity attack when they enter your reach"
      ],
      "description": "You can keep your enemies at bay with reach weapons."
    },
    {
      "name": "Resilient",
      "category": "General",
      "prerequisite": "None",
      "repeatable": true,
      "benefits": [
        "Increase one ability score of your choice by 1, to a maximum of 20",
        "You gain proficiency in saving throws using the chosen ability"
      ],
      "description": "Choose one ability score. You gain proficiency in saving throws using that ability.",
      "ability_increases": {
        "choices": ["Strength", "Dexterity", "Constitution", "Intelligence", "Wisdom", "Charisma"],
        "amount": 1
      },
      "note": "You can select this feat multiple times, choosing a different ability score each time."
    },
    {
      "name": "Ritual Caster",
      "category": "General",
      "prerequisite": "Intelligence or Wisdom 13 or higher",
      "repeatable": false,
      "benefits": [
        "Choose one of the following classes: bard, cleric, druid, sorcerer, warlock, or wizard",
        "You acquire a ritual book holding two 1st-level spells of your choice from the chosen class's spell list",
        "The spells must have the ritual tag",
        "You can cast these ritual spells without preparing them",
        "If you come across a spell in written form (a spell scroll or wizard's spellbook), you can add it to your ritual book if it has the ritual tag and is of a spell level you can cast"
      ],
      "description": "You have learned a number of spells that you can cast as rituals.",
      "grants_spells": ["Two 1st-level ritual spells"]
    },
    {
      "name": "Savage Attacker",
      "category": "General",
      "prerequisite": "None",
      "repeatable": false,
      "benefits": [
        "Once per turn when you roll damage for a melee weapon attack, you can reroll the weapon's damage dice and use either total"
      ],
      "description": "Once per turn when you roll damage for a melee weapon attack, you can reroll the weapon's damage dice and use either total."
    },
    {
      "name": "Sentinel",
      "category": "General",
      "prerequisite": "None",
      "repeatable": false,
      "benefits": [
        "When you hit a creature with an opportunity attack, the creature's speed becomes 0 for the rest of the turn",
        "Creatures provoke opportunity attacks from you even if they take the Disengage action before leaving your reach",
        "When a creature within 5 feet of you makes an attack against a target other than you, you can use your reaction to make a melee weapon attack against the attacking creature"
      ],
      "description": "You have mastered techniques to take advantage of every drop in any enemy's guard."
    },
    {
      "name": "Shadow Touched",
      "category": "General",
      "prerequisite": "None",
      "repeatable": false,
      "benefits": [
        "Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20",
        "You learn the Invisibility spell and one 1st-level spell of your choice from the illusion or necromancy school",
        "You can cast each of these spells without expending a spell slot once per long rest",
        "You can also cast these spells using spell slots you have of the appropriate level"
      ],
      "description": "Your exposure to the Shadowfell's magic has changed you, granting you the following benefits.",
      "ability_increases": {
        "choices": ["Intelligence", "Wisdom", "Charisma"],
        "amount": 1
      },
      "grants_spells": ["Invisibility", "One 1st-level illusion or necromancy spell"]
    },
    {
      "name": "Sharpshooter",
      "category": "General",
      "prerequisite": "None",
      "repeatable": false,
      "benefits": [
        "Attacking at long range doesn't impose disadvantage on your ranged weapon attack rolls",
        "Your ranged weapon attacks ignore half cover and three-quarters cover",
        "Before you make an attack with a ranged weapon that you are proficient with, you can choose to take a -5 penalty to the attack roll. If the attack hits, you add +10 to the attack's damage"
      ],
      "description": "You have mastered ranged weapons and can make shots that others find impossible."
    },
    {
      "name": "Shield Master",
      "category": "General",
      "prerequisite": "None",
      "repeatable": false,
      "benefits": [
        "If you take the Attack action on your turn, you can use a bonus action to try to shove a creature within 5 feet of you with your shield",
        "If you aren't incapacitated, you can add your shield's AC bonus to any Dexterity saving throw you make against a spell or other harmful effect",
        "If you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you can use your reaction to take no damage if you succeed on the saving throw, interposing your shield between yourself and the source of the effect"
      ],
      "description": "You use shields not just for protection but also for offense."
    },
    {
      "name": "Skill Expert",
      "category": "General",
      "prerequisite": "None",
      "repeatable": true,
      "benefits": [
        "Increase one ability score of your choice by 1, to a maximum of 20",
        "You gain proficiency in one skill of your choice",
        "Choose one skill in which you have proficiency. You gain expertise with that skill, which means your proficiency bonus is doubled for any ability check you make with it"
      ],
      "description": "You have honed your proficiency with particular skills.",
      "ability_increases": {
        "choices": ["Strength", "Dexterity", "Constitution", "Intelligence", "Wisdom", "Charisma"],
        "amount": 1
      },
      "note": "You can select this feat multiple times."
    },
    {
      "name": "Skulker",
      "category": "General",
      "prerequisite": "Dexterity 13 or higher",
      "repeatable": false,
      "benefits": [
        "You can try to hide when you are lightly obscured from the creature from which you are hiding",
        "When you are hidden from a creature and miss it with a ranged weapon attack, making the attack doesn't reveal your position",
        "Dim light doesn't impose disadvantage on your Perception checks relying on sight"
      ],
      "description": "You are expert at slinking through shadows."
    },
    {
      "name": "Spell Sniper",
      "category": "General",
      "prerequisite": "The ability to cast at least one spell",
      "repeatable": false,
      "benefits": [
        "When you cast a spell that requires you to make an attack roll, the spell's range is doubled",
        "Your ranged spell attacks ignore half cover and three-quarters cover",
        "You learn one cantrip that requires an attack roll from a spell list of your choice"
      ],
      "description": "You have learned techniques to enhance your attacks with certain kinds of spells.",
      "grants_spells": ["One attack roll cantrip"]
    },
    {
      "name": "Tavern Brawler",
      "category": "General",
      "prerequisite": "None",
      "repeatable": false,
      "benefits": [
        "Increase your Strength or Constitution score by 1, to a maximum of 20",
        "You are proficient with improvised weapons",
        "Your unarmed strike uses a d4 for damage",
        "When you hit a creature with an unarmed strike or an improvised weapon on your turn, you can use a bonus action to attempt to grapple the target"
      ],
      "description": "Accustomed to rough-and-tumble fighting using whatever weapons happen to be at hand.",
      "ability_increases": {
        "choices": ["Strength", "Constitution"],
        "amount": 1
      }
    },
    {
      "name": "Telekinetic",
      "category": "General",
      "prerequisite": "None",
      "repeatable": false,
      "benefits": [
        "Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20",
        "You learn the Mage Hand cantrip. If you already know this cantrip, its range increases by 30 feet",
        "The cantrip's hand is invisible",
        "As a bonus action, you can try to telekinetically shove one creature you can see within 30 feet of you"
      ],
      "description": "You learn to move things with your mind.",
      "ability_increases": {
        "choices": ["Intelligence", "Wisdom", "Charisma"],
        "amount": 1
      },
      "grants_spells": ["Mage Hand"]
    },
    {
      "name": "Telepathic",
      "category": "General",
      "prerequisite": "None",
      "repeatable": false,
      "benefits": [
        "Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20",
        "You can speak telepathically to any creature you can see within 60 feet of you",
        "You can cast the Detect Thoughts spell once per long rest without requiring a spell slot or components"
      ],
      "description": "You awaken the ability to mentally connect with others.",
      "ability_increases": {
        "choices": ["Intelligence", "Wisdom", "Charisma"],
        "amount": 1
      },
      "grants_spells": ["Detect Thoughts (1/long rest)"]
    },
    {
      "name": "Tough",
      "category": "General",
      "prerequisite": "None",
      "repeatable": false,
      "benefits": [
        "Your hit point maximum increases by an amount equal to twice your level when you gain this feat",
        "Whenever you gain a level thereafter, your hit point maximum increases by an additional 2 hit points"
      ],
      "description": "Your hit point maximum increases by an amount equal to twice your level when you gain this feat.",
      "note": "+2 HP per level (retroactive and ongoing)"
    },
    {
      "name": "War Caster",
      "category": "General",
      "prerequisite": "The ability to cast at least one spell",
      "repeatable": false,
      "benefits": [
        "You have advantage on Constitution saving throws that you make to maintain your concentration on a spell when you take damage",
        "You can perform the somatic components of spells even when you have weapons or a shield in one or both hands",
        "When a hostile creature's movement provokes an opportunity attack from you, you can use your reaction to cast a spell at the creature, rather than making an opportunity attack"
      ],
      "description": "You have practiced casting spells in the midst of combat."
    },
    {
      "name": "Weapon Master",
      "category": "General",
      "prerequisite": "None",
      "repeatable": false,
      "benefits": [
        "Increase your Strength or Dexterity score by 1, to a maximum of 20",
        "You gain proficiency with four weapons of your choice"
      ],
      "description": "You have practiced extensively with a variety of weapons.",
      "ability_increases": {
        "choices": ["Strength", "Dexterity"],
        "amount": 1
      }
    }
  ]
}
